function toTranslate(text) {
    var letters = {
        "a": "a", "А": "A",
        "б": "b", "Б": "B",
        "в": "v", "В": "V",
        "г": "g", "Г": "G",
        "д": "d", "Д": "D",
        "е": "e", "Е": "E",
        "ё": "e", "Ё": "E",
        "ж": "zh", "Ж": "Zh",
        "з": "z", "З": "Z",
        "и": "i", "И": "I",
        "й": "i", "Й": "I",
        "к": "k", "К": "K",
        "л": "l", "Л": "L",
        "м": "m", "М": "M",
        "н": "n", "Н": "N",
        "о": "o", "О": "O",
        "п": "p", "П": "P",
        "р": "r", "Р": "R",
        "с": "s", "С": "S",
        "т": "t", "Т": "T",
        "у": "u", "У": "U",
        "ф": "f", "Ф": "F",
        "х": "h", "Х": "H",
        "ц": "c", "Ц": "C",
        "ч": "ch", "Ч": "Ch",
        "ш": "sh", "Ш": "Sh",
        "щ": "sch", "Щ": "Sch",
        "ь": "", "Ь": "",
        "ъ": "", "Ъ": "",
        "ы": "y", "Ы": "Y",
        "э": "e", "Э": "E",
        "ю": "yu", "Ю": "Yu",
        "я": "ya", "Я": "Ya",
        "ө": "o", "Ө": "O",
        "ә": "a", "Ә": "A",
        "і": "i", "І": "I",
        "ң": "nh", "Ң": "Nh",
        "ғ": "gh", "Ғ": "Gh",
        "ү": "u", "Ү": "U",
        "ұ": "u", "Ұ": "U",
        "қ": "q", "Қ": "Q",
        "һ": "h", "Һ": "H",
    };

    let translated = '';
    let k;
    for(let i = 0; i < text.length; i++) {
        k = text.substring(i, i+1);
        if(letters[k]) translated += letters[k];
        else translated += k;
    }
    return translated;
}

console.log(toTranslate('ИП Манная'));